1.Что такое Spring? Какие основные задачи выполняет этот фреймворк?
 
2. Что такое IoC и DI? В чем отличие этих терминов?
 
3. Перечислите основные модули Spring фреймворка.
 
4. Перечислите способы инъекций зависимостей.
 
5. Что такое ApplicationContext? Когда он создается?
 
6. Расскажите, что такое Spring Bean? Опишите жизненный цикл Spring Bean?
 
7. Объясните для чего используются аннотации @Autowired @Qualifier. Когда, какой нужно использовать?
 
8. Что такое FactoryBeans?
 
9. Что такое Profiles? Когда их используют.
 
10. Расскажите про модуль Spring AOP.
 
11. Объясните шаблон проектирование Proxy? Где он используется в Spring.
 
12. Объясните, как происходит интеграция с JDBC.
 
13. Объясните, как происходит интеграция с Hibernate.
 
14. Что такое Transaction Manager? Где он используется? Когда он нужен?
 
15. Расскажите о модуле Spring MVC.
 
16. Объясните верхнеуровневую архитектуру Spring MVC: Dispatcher, ViewResolver.
 
17. Как конфигурировать Spring MVC?
 
18. Что такое Spring scope? Какие типы Spring scope существуют?
 
19. Расскажите про аннотации @RequestMapping, @PathVariable, @RequestBody, @RequestParam, @ModelAttribute, @ResponseBody, @SessionAttribute, @CookieValue.
 
20. Расскажите про модуль Spring Security?
 
21. Как конфигурировать Spring Security?
 
22. Что такое UserDetails?
 
23.  Расскажите верхнеуровневую архитектуру Spring Security.
 
24. Что такое FilterChainProxy?
 
25. Расскажите о схеме работы пользователь-роль.
 
26. Расскажите о SpringContextHolder.
 
27. Расскажите об аспектах многопоточного окружения в Spring.
 
28. Расскажите о тестирование Spring приложений?
 
29. Расскажите о тестирование Spring MVС приложений.
 
30. Расскажите о мониторинге Spring приложений.
